# =========================
# シナリオ1 : DGP
# =========================
# サンプルサイズ
N <- 100
# 再現性
set.seed(0)

# -------------------------
# 誤差項
# -------------------------
e1 <- rnorm(N, sd = 0.5)
e2 <- rnorm(N, sd = 0.5)
e3 <- rnorm(N, sd = 0.5)
e4 <- rnorm(N, sd = 0.5)

# -------------------------
# 係数
# -------------------------
coef_L1X1 <- 1
coef_L2X2 <- 1

coef_X1T <- 1
coef_X2T <- 1

coef_X1Y <- 1
coef_X2Y <- 1

# 真の処置効果
effect <- 1

# -------------------------
# 潜在変数
# -------------------------
L1 <- rnorm(N)
L2 <- rnorm(N)

# -------------------------
# 観測変数
# -------------------------
X1 <- coef_L1X1 * L1 + e1
X2 <- coef_L2X2 * L2 + e2

# -------------------------
# 処置変数
# -------------------------
linpred_T <- coef_X1T * X1 + coef_X2T * X2 + e3
p_T <- plogis(linpred_T)
T <- rbinom(N, 1, p_T)

# -------------------------
# 潜在アウトカム
# -------------------------
Y0 <- coef_X1Y * X1 + coef_X2Y * X2 + e4
Y1 <- coef_X1Y * X1 + coef_X2Y * X2 + effect + e4

# -------------------------
# 実現アウトカム
# -------------------------
Y <- ifelse(T == 1, Y1, Y0)

# データフレーム
df1 <- data.frame(L1, L2, X1, X2, T, Y0, Y1, Y)
